[
    {"title": "Hands Off Rafah - Ceasefire Now",
    "category": "Israeli Occupation",
    "organizer": "Palestinian Youth Movement",
    "description": "Seattle is home to major corporations, universities, politicians, and media that are supporting Israel's genocidal occupation. But Seattle is also home to hundreds of thousands of people who firmly stand with Palestine and their struggle for liberation! As Israel and the US threaten Rafah with invasion, the time is now to mobilize! No amount of repression and intimidation will stop us. Join us and continue to shut it down for Palestine! #shutitdown4palestine",
    "date": "Saturday, March 2nd",
    "time": "1:00PM (PST)",
    "location_name": "Denny Park",
    "address": "100 Dexter Ave N",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98109",
    "latitude": 47.619181501784794,
    "longitude": -122.34091630924817,
    "img": "images/handsoffrafah.png",
    "img_alt_text": "Poster for Hands off Rafah Protest in Seattle"
    },
    {"title": "End the Vegan Milk Surcharge, Starbucks!",
    "category": "Animal Rights",
    "organizer": "Animal Rights Initiative: Seattle",
    "description": "Starbucks is contributing over 16 million tons of carbon into our atmosphere every year. Over 1/5, or 3.52 million, comes from dairy milk alone. That's twice as much as their coffee and four times as much as their packaging! They continue to present themselves as a forward conscious company, committing to sustainability goals. We need to show them we see through their green-washing manipulation tactics and won't allow baby cows to be murdered for lattes and frappuccinos. We need accessibility to veganism for everyone in order to prevent unnecessary cruelty to animals and destruction to our planet. Starbucks already offers non-dairy milk for the same cost as cow's milk in the UK, France and Germany. When much smaller chains like Stumptown Coffee can offer oat milk as their default milk, massive Starbucks can afford to do what's right for the environment, animals and Americans.",
    "date": "Thursday, February 29th",
    "time": "12:00PM - 1:30 PM (PST)",
    "location_name": "Starbucks",
    "address": "2011 7th Ave",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98121",
    "latitude": 47.61537815082428, 
    "longitude": -122.33818331501348,
    "img": "images/veganmilk.png",
    "img_alt_text": "Protestors with signs on vegan milk surcharge outside of Suzzallo Library"
    },
    {"title": "Protest Jimmy John's and Inspire Brands",
    "category": "Animal Rights",
    "organizer": "Volunteers",
    "description": "Inspire has a bunch of big names under their management, including Arby's, Baskin Robbins, Buffalo Wild Wings, Dunkin'' Donuts, Jimmy John's and Sonic. Inspire committed to source 100% cage-free eggs globally by 2025, but have not been reporting on their progress. We're asking them to resume reporting on their progress towards cage free. Getting them to report would be a big win: they have over 31,700 restaurants worldwide. We're targeting Jimmy John's as part of a national pressure campaign. Come join us as we hold signs and talk to patron and employees about why its important that Jimmy John's (and Inspire Brands generally) report progress against their promise to phase out cruel cages for hens.",
    "date": "Saturday, March 2nd",
    "time": "2:00PM - 3:00 PM (PST)",
    "location_name": "Jimmy John's",
    "address": "507 NE Northgate Way",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98125",
    "latitude": 47.70860189932917,
    "longitude": -122.3222600573398,
    "img": "images/jimmyjohns.png",
    "img_alt_text": "Logo for The Humane League, showing three individuals as protestors"
    }
]