{
    "Protests" : [{"title": "Hands Off Rafah - Ceasefire Now",
    "category": "Israeli Occupation",
    "organizer": "Palestinian Youth Movement",
    "description": "Seattle is home to major corporations, universities, politicians, and media that are supporting Israel's genocidal occupation. But Seattle is also home to hundreds of thousands of people who firmly stand with Palestine and their struggle for liberation! As Israel and the US threaten Rafah with invasion, the time is now to mobilize! No amount of repression and intimidation will stop us. Join us and continue to shut it down for Palestine! #shutitdown4palestine",
    "date": "Saturday, March 2nd",
    "time": "1:00PM (PST)",
    "location_name": "Denny Park",
    "address": "100 Dexter Ave N",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98109",
    "latitude": 47.619181501784794,
    "longitude": -122.34091630924817,
    "img": "images/handsoffrafah.png",
    "img_alt_text": "Poster for Hands off Rafah Protest in Seattle"
    },
    {"title": "End the Vegan Milk Surcharge, Starbucks!",
    "category": "Animal Rights",
    "organizer": "Animal Rights Initiative: Seattle",
    "description": "Starbucks is contributing over 16 million tons of carbon into our atmosphere every year. Over 1/5, or 3.52 million, comes from dairy milk alone. That's twice as much as their coffee and four times as much as their packaging! They continue to present themselves as a forward conscious company, committing to sustainability goals. We need to show them we see through their green-washing manipulation tactics and won't allow baby cows to be murdered for lattes and frappuccinos. We need accessibility to veganism for everyone in order to prevent unnecessary cruelty to animals and destruction to our planet. Starbucks already offers non-dairy milk for the same cost as cow's milk in the UK, France and Germany. When much smaller chains like Stumptown Coffee can offer oat milk as their default milk, massive Starbucks can afford to do what's right for the environment, animals and Americans.",
    "date": "Thursday, February 29th",
    "time": "12:00PM - 1:30 PM (PST)",
    "location_name": "Starbucks",
    "address": "2011 7th Ave",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98121",
    "latitude": 47.61537815082428, 
    "longitude": -122.33818331501348,
    "img": "images/veganmilk.png",
    "img_alt_text": "Protestors with signs on vegan milk surcharge outside of Suzzallo Library"
    },
    {"title": "Protest Jimmy John's and Inspire Brands",
    "category": "Animal Rights",
    "organizer": "Volunteers",
    "description": "Inspire has a bunch of big names under their management, including Arby's, Baskin Robbins, Buffalo Wild Wings, Dunkin'' Donuts, Jimmy John's and Sonic. Inspire committed to source 100% cage-free eggs globally by 2025, but have not been reporting on their progress. We're asking them to resume reporting on their progress towards cage free. Getting them to report would be a big win: they have over 31,700 restaurants worldwide. We're targeting Jimmy John's as part of a national pressure campaign. Come join us as we hold signs and talk to patron and employees about why its important that Jimmy John's (and Inspire Brands generally) report progress against their promise to phase out cruel cages for hens.",
    "date": "Saturday, March 2nd",
    "time": "2:00PM - 3:00 PM (PST)",
    "location_name": "Jimmy John's",
    "address": "507 NE Northgate Way",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98125",
    "latitude": 47.70860189932917,
    "longitude": -122.3222600573398,
    "img": "images/jimmyjohns.png",
    "img_alt_text": "Logo for The Humane League, showing three individuals as protestors"
    },
    {"title": "Protest Boeing's War Profiteer Extravaganza (A&DSS)",
    "category": "Israeli Occupation",
    "organizer": "Seattle Democratic Socialists of America",
    "description": "Boeing makes the majority of its $60+ billion in annual revenues from defense contracts, including one for 1,800 missile targeting kits Israel uses to bomb Gaza. The war has killed or wounded over a hundred thousand Gazans (over five percent of Gaza’s total population) and left the majority of the surviving population at immediate risk of starvation unless a ceasefire is implemented. As Washingtonians, our federal, state, and even local taxes subsidize Boeing’s support for Israel’s genocidal campaign in Gaza. Make your voice heard and stand with the people of Gaza by demanding an immediate and permanent ceasefire, an end to US military aid to Israel, and an end to the US war on Yemen.",
    "date": "Tuesday, March 12th",
    "time": "12:00PM - 2:00PM (PST)",
    "location_name": "Seattle Convention Center Jim Ellis Plaza",
    "address": "Freeway Park",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98101",
    "latitude": 47.610809130477584,
    "longitude": -122.33076412561915,
    "img": "images/notoboeing.png",
    "img_alt_text": "Poster for No To Boeing Protest in Seattle"
    },
    {"title": "The Official San Diego Animal Rights March 2024",
    "category": "Animal Rights",
    "organizer": "San Diego Vegan Activists",
    "description": "🥁The Official San Diego Animal Rights March is back!🥁 And the animals need YOU!!! Together we stand up, speak out and demand NO MORE OPPRESSION, ANIMAL LIBERATION for ALL EARTHLINGS. Right here in San Diego and across the globe we unite for our animal friends! In order to make this march successful, we need your support. Please invite your friends and tell every vegan you meet that this is the day where we unite, where we stand up, rise up and say no more animal abuse!",
    "date": "Saturday, May 18th",
    "time": "10:00AM - 2:00PM (PST)",
    "location_name": "Pantoja Park",
    "address": "West G Street",
    "state": "CA",
    "city": "San Diego", 
    "zip": "92101",
    "latitude": 32.71322431573346, 
    "longitude": -117.16788055467136,
    "img": "images/sandiegoveganprotest.png",
    "img_alt_text": "Protestors hold signs for the rights of pigs, cows, and chickens in San Diego"
    },
    {"title": "Take Back the Night",
    "category": "Sexual and Domestic Violence",
    "organizer": "UO Women's Center",
    "description": "TBTN is a yearly international protest founded in 1976 which seeks to raise awareness about the realities of sexual and domestic violence on campus and in the community, both for survivors of sexual and domestic violence and those who want to support and bear witness in solidarity. TBTN is a survivor-centered event that begins with a Rally in the EMU Amphitheater at 6pm, continues at 7pm as a  March through the streets of Eugene to symbolize reclaiming people’s safety on public streets at night – and ends back on campus for a Speak Out in the EMU.",
    "date": "Thursday, April 25th",
    "time": "6:00PM - 10:00PM (PST)",
    "location_name": "Erb Memorial Union (EMU) Amphitheater",
    "address": "1395 University Street",
    "state": "OR",
    "city": "Eugene", 
    "zip": "97403",
    "latitude": 44.045602840276516, 
    "longitude": -123.07360076190807,
    "img": "images/feministhive.png",
    "img_alt_text": "Sign for Feminist Hive, showing a fist within a beehive"
    },
    {"title": "Rapid Fire Action Half Hour (Virtual)",
    "category": "Animal Rights",
    "organizer": "The Humane League (NYC)",
    "description": "Digital actions are one of the easiest and effective forms of activism to improve the lives of animals in the food system. We understand that in our busy lives we might forget to keep up with the actions, and assume we're 'just one person.' But only as a collective do we have the power to end corporate greed. So, we would like to create a space where we all dedicate 20-30 minutes a week taking these essential actions, calling out companies for their lack of transparency and basic animal welfare.",
    "date": "Monday, March 25th",
    "time": "3:30PM - 4:00PM (EST)",
    "location_name": "Virtual",
    "address": "",
    "state": "",
    "city": "", 
    "zip": "",
    "latitude": 0, 
    "longitude": 0,
    "img": "images/digitalactivist.png",
    "img_alt_text": "Four individuals signing a paper, urging protestors to join"
    },
    {"title": "Dump the Vegan Milk Surcharge Already!!!!!",
    "category": "Animal Rights",
    "organizer": "Animal Rights Initiative: Seattle",
    "description": "This will be a peaceful indoor protest at a Starbucks location to send our message that we want this multi-billion dollar corporation to simply charge parity between non-dairy and dairy milks. Starbucks is contributing over 16 million tons of carbon into our atmosphere every year. Over 1/5, or 3.52 million, comes from dairy milk alone. That's twice as much as their coffee and four times as much as their packaging! They continue to present themselves as a forward conscious company, committing to sustainability goals. We need to show them we see through their green-washing manipulation tactics and won't allow baby cows to be murdered for lattes and frappuccinos. We need accessibility to veganism for everyone in order to prevent unnecessary cruelty to animals and destruction to our planet. Starbucks already offers non-dairy milk for the same cost as cow's milk in the UK, France and Germany. When much smaller chains like Stumptown Coffee can offer oat milk as their default milk, massive Starbucks can afford to do what's right for the environment, animals and Americans.",
    "date": "Thursday, March 21st",
    "time": "12:00PM - 1:30PM (PST)",
    "location_name": "Seattle Center Armory Food & Event Hall Starbucks",
    "address": "305 Harrison St",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98109",
    "latitude": 47.6215574667281,
    "longitude": -122.35094651086219,
    "img": "images/starbucksmilk.png",
    "img_alt_text": "Starbucks cup with demands to stop charging extra for vegan milk, with protestors in the background"
    },
    {"title": "Rally at Kamlager-Dove's Office",
    "category": "Israeli Occupation",
    "organizer": "Justice 4 Palestine LA",
    "description": "Tell Rep. Kamlager-Dove: no arms to Israel! Fund UNRWA! Permanent Ceasefire Now!",
    "date": "Thursday, March 14th",
    "time": "4:30PM - 6:00PM (PST)",
    "location_name": "Kamlager-Dove's Office",
    "address": "4929 Wilshire Blvd",
    "state": "CA",
    "city": "Los Angeles", 
    "zip": "90010",
    "latitude": 34.062603364847796,
    "longitude": -118.33818774232824,
    "img": "images/j4pla.png",
    "img_alt_text": "Event poster with details and Rep. Kamlager-Dove on the right"
    },
    {"title": "“What Would Esther Do”: Purim for Liberation and Peace",
    "category": "Israeli Occupation",
    "organizer": "If Not Now",
    "description": "Join us for a rally that fulfills some of the mitzvot of Purim while calling for a lasting ceasefire. There will be solidarity, hamantaschen, groggers, calls for justice, songs, fundraising for humanitarian aid to Gaza, alternate imaginings of how the Purim story could end, and more!",
    "date": "Sunday, March 24th",
    "time": "1:00PM - 3:00PM (PST)",
    "location_name": "Cal Anderson Park, North of Fountain",
    "address": "1635 11th Ave",
    "state": "WA",
    "city": "Seattle", 
    "zip": "98122",
    "latitude": 47.61651104489804,
    "longitude": -122.31919062882663,
    "img": "images/ifnotnow.png",
    "img_alt_text": "Logo for If Not Now"
    }]
}